<template>
  <module-module1></module-module1>
</template>

<script>
  require('styles/page-test1.scss');
  import Vue from 'vue';

  //**********************************************************************页面模块共享状态
  //**************************************************************
  //**************************************************************
  app.page.shares.test1Event = new Vue();
  app.page.shares.test1Store = {
    state: {}
  };

  //**********************************************************************注册页面模块
  //**************************************************************
  //**************************************************************
  //**********XX模块
  Vue.component('module-module1', require('views/page-test1/module1'));

</script>

