<template>
<module-module1></module-module1>
</template>

<script>
require('styles/<%=filename%>.scss');
import Vue from 'vue';

//**********************************************************************页面模块共享状态
//**************************************************************
//**************************************************************
app.page.shares.<%=camelname%>Event = new Vue();
app.page.shares.<%=camelname%>Store = {
  state: {}
};

//**********************************************************************注册页面模块
//**************************************************************
//**************************************************************
//**********XX模块
Vue.component('module-module1', require('views/<%=filename%>/module1'));

</script>

